package gitStart;

public class Info2 {
	
	/**
	 * 1. Команда git init создает репозиторий — директорию .git, которая содержит все необходимые для работы git файлы.
	 * 2. С помощью команды git status можно посмотреть статус репозитория
	 * 3. # Создаем файл README.md со строкой текста
	 * # Для каждого нового или измененного файла
	 * 4. Первым шагом выполняется команда подготовки файлов git add <путь до файла>:
	 * 5. Второй шаг git commit -m 'add README.md'
	 * 6. Создайте репозиторий на Гитхабе. Назовите его hexlet-git. Важно, чтобы репозиторий создавался пустым, поэтому не отмечайте галочки, добавляющие файлы.
	 * 7. # Подробнее эти команды мы разберём позже
git branch -M main
git remote add origin git@github.com:<ИМЯ НА ГИТХАБЕ>/hexlet-git.git
git push -u origin main

// Клонирование репозитория.
	 * 8. git clone
	 * Полную команду для клонирования можно получить на странице репозитория. Для этого нажмите большую кнопку Code, перейдите на вкладку SSH и скопируйте содержимое.
	 * 9. git pull --rebase, которая скачивает из внешнего репозитория новые коммиты и добавляет их в локальный репозиторий.
	 * 10. 
	 * 
	 */

}
